// @strict-types


#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти
#Область ОбработчикиСобытийЭлементовТаблицыФормыИзмерительныеПриборы

&НаКлиенте
Процедура ИзмерительныеПриборыНаименованиеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ДанныеСтроки = Элементы.ИзмерительныеПриборы.ТекущиеДанные;
	Если Не ТребуетсяПоверка(ВыбранноеЗначение) Тогда
		ПараДат = ИзмерительныеПриборыПриИзмененииНаСервере(Объект.Дата, ВыбранноеЗначение);
		ДанныеСтроки.ДатаПоверки = ПараДат.ДатаПоверки;
		ДанныеСтроки.ДатаСледующейПоверки = ПараДат.ДатаСледующейПоверки;
	Иначе
		ДанныеСтроки.ДатаПоверки = Неопределено;
		ДанныеСтроки.ДатаСледующейПоверки = Неопределено;
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//Функция проверяет требуется ли поверка оборудования
// Параметры:
//	Оборудование - СправочникСсылка.Оборудование - проверяемое оборудование
// Возвращаемое значение:
//  Булево - Истина если поверка не требуется
&НаСервере
Функция ТребуетсяПоверка(Оборудование)
	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Оборудование.ПоверкаНеТребуется 
		|ИЗ
		|	Справочник.Оборудование КАК Оборудование
		|ГДЕ
		|	Оборудование.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Оборудование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		Возврат ВыборкаДетальныеЗаписи.ПоверкаНеТребуется;
	КонецЦикла;
	
КонецФункции


//Функция возвращает дату последней и следующей поверки оборудования
//  

&НаСервере
Функция ИзмерительныеПриборыПриИзмененииНаСервере(ДатаСреза, Оборудование)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПоверкиСрезПоследних.ДатаПоверки,
		|	ПоверкиСрезПоследних.ДатаСледующейПоверки
		|ИЗ
		|	РегистрСведений.Поверки.СрезПоследних(&ДатаСреза,) КАК ПоверкиСрезПоследних
		|ГДЕ
		|	ПоверкиСрезПоследних.Оборудование = &Оборудование";
	
	Запрос.УстановитьПараметр("Оборудование", Оборудование);
	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Даты = Новый Структура();
		Даты.Вставить("ДатаПоверки", ВыборкаДетальныеЗаписи.ДатаПоверки);
		Даты.Вставить("ДатаСледующейПоверки", ВыборкаДетальныеЗаписи.ДатаСледующейПоверки);
		Возврат  Даты;
	КонецЦикла;
	Возврат Неопределено;
КонецФункции
#КонецОбласти

