
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)
	// регистр Поверки
	Движения.Поверки.Записывать = Истина;
	Движение = Движения.Поверки.Добавить();
	Движение.Период = Дата;
	Движение.Оборудование = Оборудование;
	Движение.ДатаПоверки = ДатаПоверки;
	Движение.ДатаСледующейПоверки = ДатаСледующейПоверки;

КонецПроцедуры// @strict-types


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
